### Exploring NYC Public Schools Test Result Scores
*Exploratory data analysis in Python*

**Project Description**

Each year, American high school students take SATs, which are standardized tests intended to measure  
literacy, numeracy, and writing skills. There are three sections - reading, math, and writing, each with  
a maximum score of 800 points. These tests play a pivotal role in college admissions.

A dataset called `schools.csv` is provided.

Answer three key questions about New York City (NYC) public school SAT performance.

#### Load the `schools.csv` file

In [32]:
# Import pandas
import pandas as pd

# Read in the data
schools = pd.read_csv('schools.csv')

# Preview the data
schools.head()

,school_name,borough,building_code,average_math,average_reading,average_writing,percent_tested
0,"New Explorations into Science, Technology and ...",Manhattan,M022,657,601,601,NaN
1,Essex Street Academy,Manhattan,M445,395,411,387,78.9
2,Lower Manhattan Arts Academy,Manhattan,M445,418,428,415,65.1
3,High School for Dual Language and Asian Studies,Manhattan,M445,613,453,463,95.9
4,Henry Street School for International Studies,Manhattan,M056,410,406,381,59.7

In [33]:
# Inspect DataFrame
schools.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 375 entries, 0 to 374
Data columns (total 7 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   school_name      375 non-null    object
 1   borough          375 non-null    object
 2   building_code    375 non-null    object
 3   average_math     375 non-null    int64
 4   average_reading  375 non-null    int64
 5   average_writing  375 non-null    int64
 6   percent_tested   355 non-null    float64
dtypes: float64(1), int64(3), object(3)
memory usage: 20.6+ KB

In [34]:
# Check for duplicates
duplicates = schools[schools.duplicated()]

print('Duplicate rows:')
duplicates

Duplicate rows:

Empty DataFrame
Columns: [school_name, borough, building_code, average_math, average_reading, average_writing, percent_tested]
Index: []

#### Schools with the best math scores

Find the schools with math scores of at least 80%, considering the maximum possible score is 800.

In [35]:
# Find schools where the average_math scores are at least 80% of the possible
# maximum score, sorted by average_math in descending order
best_math_schools = schools[schools['average_math'] >= (0.8 * 800)]\
    [['school_name', 'average_math']].sort_values('average_math', ascending=False)

# Preview the data
best_math_schools.head()

                                           school_name  average_math
88                              Stuyvesant High School           754
170                       Bronx High School of Science           714
93                 Staten Island Technical High School           711
365  Queens High School for the Sciences at York Co...           701
68   High School for Mathematics, Science, and Engi...           683

#### Top 10 performing schools

Find the 10 best performing schools based on the average total score across the three SAT sections.

In [51]:
# Create list of columns to be added together
cols = ['average_math', 'average_reading', 'average_writing']

# Store sum of values in a new column
schools['total_SAT'] = schools[cols].sum(axis=1)

# Create a new DataFrame with total_SAT scores in descending order
top_10_schools = schools[['school_name', 'total_SAT']].sort_values('total_SAT', ascending=False)

# Identify the top 10 performing schools
top_10_schools = top_10_schools.iloc[:10]

top_10_schools

                                           school_name  total_SAT
88                              Stuyvesant High School       2144
170                       Bronx High School of Science       2041
93                 Staten Island Technical High School       2041
174  High School of American Studies at Lehman College       2013
333                        Townsend Harris High School       1981
365  Queens High School for the Sciences at York Co...       1947
5                       Bard High School Early College       1914
280                     Brooklyn Technical High School       1896
45                       Eleanor Roosevelt High School       1889
68   High School for Mathematics, Science, and Engi...       1889

#### NYC borough with the largest standard deviation in SAT performance

Find out the number of schools, average SAT, and standard deviation of SAT for the NYC borough with the  
largest standard deviation, rounded to two decimal places.

In [57]:
# NYC borough with the largest standard deviation
boroughs = schools.groupby('borough')['total_SAT'].agg(['count', 'mean', 'std']).round(2)
boroughs

               count     mean     std
borough
Bronx             98  1202.72  150.39
Brooklyn         109  1230.26  154.87
Manhattan         89  1340.13  230.29
Queens            69  1345.48  195.25
Staten Island     10  1439.00  222.30

In [64]:
# Filter for max std and reset index
largest_std_dev = boroughs[boroughs['std'] == boroughs['std'].max()].reset_index('borough')
largest_std_dev

     borough  count     mean     std
0  Manhattan     89  1340.13  230.29

In [68]:
# Rename columns
largest_std_dev = largest_std_dev.rename(columns={'count':'num_schools', 'mean':'average_SAT', 'std':'std_SAT'})

# Preview the results
largest_std_dev

     borough  num_schools  average_SAT  std_SAT
0  Manhattan           89      1340.13   230.29